# Export Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
INavisworksExporter..::..Export Method
INavisworksExporter Interface See Also
---
The method that Revit will invoke to perform an export to Navisworks.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
void Export(
	Document document,
	string folder,
	string name,
	NavisworksExportOptions options
)
```

Visual Basic
---
```text
Sub Export ( _
	document As Document, _
	folder As String, _
	name As String, _
	options As NavisworksExportOptions _
)
```

Visual C++
---
```text
void Export(
	Document^ document,
	String^ folder,
	String^ name,
	NavisworksExportOptions^ options
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document The document to export.
folder
    Type: System..::..String The folder path.
name
    Type: System..::..String The file name.
options
    Type: Autodesk.Revit.DB..::..NavisworksExportOptions The export options.
# See Also
INavisworksExporter Interface
Autodesk.Revit.DB Namespace